export const NEPALI_DIGITS = "०१२३४५६७८९"

export const NEPALI_SCALES: {
  value: number
  label_np: string
  label_en: string
  label_ordinal: string
}[] = [
  { value: 1e19, label_np: "महाशंख", label_en: "maha-shankh", label_ordinal: "महाशंखौं" },
  { value: 1e17, label_np: "शंख", label_en: "shankh", label_ordinal: "शंखौं" },
  { value: 1e15, label_np: "पद्म", label_en: "padma", label_ordinal: "पदमौं" },
  { value: 1e13, label_np: "नील", label_en: "neel", label_ordinal: "नीलौं" },
  { value: 1e11, label_np: "खर्ब", label_en: "kharab", label_ordinal: "खरबौं" },
  { value: 1e9, label_np: "अर्ब", label_en: "arab", label_ordinal: "अरबौं" },
  { value: 1e7, label_np: "करोड", label_en: "crore", label_ordinal: "करोडौं" },
  { value: 1e5, label_np: "लाख", label_en: "lakh", label_ordinal: "लाखौं" },
  { value: 1e3, label_np: "हजार", label_en: "thousand", label_ordinal: "हजारौं" },
  { value: 1e2, label_np: "सय", label_en: "hundred", label_ordinal: "सयौं" },
]

export const NEPALI_WORDS: string[] = [
  "शून्य",
  "एक", "दुई", "तीन", "चार", "पाँच", "छ", "सात", "आठ", "नौ", "दश",
  "एघार", "बाह्र", "तेह्र", "चौध", "पन्ध्र", "सोह्र", "सत्र", "अठार", "उन्नाइस", "बीस",
  "एक्काईस", "बाईस", "तेईस", "चौबीस", "पच्चीस", "छब्बीस", "सत्ताईस", "अट्ठाईस", "उनन्तीस", "तीस",
  "एकतीस", "बत्तीस", "तेत्तीस", "चौंतीस", "पैंतीस", "छत्तीस", "सैंतीस", "अठतीस", "उनन्चालीस", "चालीस",
  "एकचालीस", "बयालीस", "त्रिचालीस", "चवालीस", "पैंतालीस", "छयालीस", "सतचालीस", "अठचालीस", "उनन्चास", "पचास",
  "एकाउन्न", "बाउन्न", "त्रिपन्न", "चउन्न", "पचपन्न", "छपन्न", "सन्ताउन्न", "अन्ठाउन्न", "उनन्साठी", "साठी",
  "एकसट्ठी", "बैसट्ठी", "त्रिसट्ठी", "चौंसट्ठी", "पैंसट्ठी", "छैसट्ठी", "सतसट्ठी", "अठसट्ठी", "उनन्सत्तरी", "सत्तरी",
  "एकहत्तर", "बहत्तर", "त्रिहत्तर", "चौहत्तर", "पचहत्तर", "छहत्तर", "सतहत्तर", "अठहत्तर", "उनासी", "असी",
  "एकासी", "बयासी", "त्रियासी", "चौरासी", "पचासी", "छयासी", "सतासी", "अठासी", "उनान्नब्बे", "नब्बे",
  "एकानब्बे", "बयानब्बे", "त्रियानब्बे", "चौरानब्बे", "पन्चानब्बे", "छयानब्बे", "सन्तानब्बे", "अन्ठानब्बे", "उनान्सय",
]

export const NEPALI_ORDINALS_EXCEPTIONS: string[] = ["शून्यौं", "पहिलो", "दोस्रो", "तेस्रो", "चौथो"]
export const NEPALI_ORDINALS: string[] = [
  "शून्य",
  "एकौं", "दुइऔं", "तीनौं", "चारौं", "पाँचौं", "छैटौं", "सातौं", "आठौं", "नवौं", "दशौं",
  "एघारौं", "बाह्रौं", "तेह्रौं", "चौधौं", "पन्ध्रौं", "सोह्रौं", "सत्रौं", "अठारौं", "उन्नाईसौं", "बीसौं",
  "एक्काईसौं", "बाईसौं", "तेईसौं", "चौबीसौं", "पच्चीसौं", "छब्बीसौं", "सत्ताईसौं", "अट्ठाईसौं", "उनन्तीसौं", "तीसौं",
  "एकतीसौं", "बत्तीसौं", "तेत्तीसौं", "चौंतीसौं", "पैंतीसौं", "छत्तीसौं", "सैंतीसौं", "अठतीसौं", "उनन्चालीसौं", "चालीसौं",
  "एकचालीसौं", "बयालीसौं", "त्रिचालीसौं", "चवालीसौं", "पैंतालीसौं", "छयालीसौं", "सतचालीसौं", "अठचालीसौं", "उनन्चासौं", "पचासौं",
  "एकाउन्नौं", "बाउन्नौं", "त्रिपन्नौं", "चउन्नौं", "पचपन्नौं", "छपन्नौं", "सन्ताउन्नौं", "अन्ठाउन्नौं", "उनन्साठीऔं", "साठीऔं",
  "एकसट्ठीऔं", "बैसट्ठीऔं", "त्रिसट्ठीऔं", "चौंसट्ठीऔं", "पैंसट्ठीऔं", "छैसट्ठीऔं", "सतसट्ठीऔं", "अठसट्ठीऔं", "उनन्सत्तरीऔं", "सत्तरीऔं",
  "एकहत्तरौं", "बहत्तरौं", "त्रिहत्तरौं", "चौहत्तरौं", "पचहत्तरौं", "छहत्तरौं", "सतहत्तरौं", "अठहत्तरौं", "उनासीऔं", "असीऔं",
  "एकासीऔं", "बयासीऔं", "त्रियासीऔं", "चौरासीऔं", "पचासीऔं", "छयासीऔं", "सतासीऔं", "अठासीऔं", "उनान्नब्बेऔं", "नब्बेऔं",
  "एकानब्बेऔं", "बयानब्बेऔं", "त्रियानब्बेऔं", "चौरानब्बेऔं", "पन्चानब्बेऔं", "छयानब्बेऔं", "सन्तानब्बेऔं", "अन्ठानब्बेऔं", "उनान्सयौं",
]

export const ENGLISH_WORDS: {
  ONES: string[]
  TEENS: string[]
  TENS: string[]
} = {
  "ONES": ["zero", "one", "two", "three", "four", "five", "six", "seven", "eight", "nine"],
  "TEENS": ["ten", "eleven", "twelve", "thirteen", "fourteen", "fifteen", "sixteen", "seventeen", "eighteen", "nineteen"],
  "TENS": ["twenty", "thirty", "forty", "fifty", "sixty", "seventy", "eighty", "ninety"],
}
